{"title":"Park alertsStorm damage - lower two way section of Gheerulla Trail Bike Area closed. (update 27 Jan)Road and campground closures  - Mapleton National Park (update 27 Jan)Temporary trail head closure - Boombana (update)Camp Mountain access road closed due to landslip (update 27 Jan)Changed Parking Conditions - Public HolidaysTemporary Closure of Clarke Range Walking TrackTemporary Closure of Denham Range CamproundTemporary closure of walking track and day-use area: Keatings Lagoon Conservation Park. (update 25 Jan)Fire Break Maintenance - Heavy MachineryTemporary closure (update 25 Jan)Temporary road closure: Goldsborough Valley road, within Wooroonooran National Park, affecting Goldsborough Valley camping and day use area and part of Goldfield trail (update)Drive with care due to road hazards (update 24 Jan)Tallebudgera Creek walking track has reopened (update 24 Jan)Joalah Lower Creek circuit closed (update 24 Jan)Welford,  Idalia and Lochern National Parks temporarily closed due to wet weather conditions (update 23 Jan)Diamantina National Park temporarily closed due to flooding (update 23 Jan)Boodjamulla National Park and Miyumba temporarily closed (update 23 Jan)Emu Swamp camp ground at Blackbraes National Park temporarily closed (update)Four-wheel-drive only - Hoppy Lark's day use area - Burrum Coast National Park (update)Walking track closure - Illinbah circuit and Gwongoorool Pool track (update 23 Jan)Roads closed due to severe weather damage (update 20 Jan)Cape Pallarenda Conservation Park exercise caution on tracks and trailsMouth of Kolan Conservation - Park Pest ManagmentTrack closure -  Purling Brook Falls circuit including Springbrook section of the 'Great Walk' track (update 19 Jan)K'gari (Fraser Island) Great Walk - advanced booking restriction (update 18 Jan)Turtle Street Camp site UpgradeUnsafe water holes on Magnetic Island (update)Main Range National Park - restricted access to southern remote bush campsSalvator Rosa section - closure due to wet weatherKa Ka Mundi section - closure due to wet weatherWet weather safety information: Smithfield Conservation Park (update 13 Jan)Temporary road closure: Wall Creek Road, Koombooloomba National ParkTemporary closure of Byfield National Park and Byfield Conservation Park for pest animal management activitiesTemporary closure of camping areas within Byfield National Park and Byfield Conservation ParkNorthern Access Track remains closed to vehicles pending major roadworks (update)Planned upgrade to the Natural Bridge visitor precinctKinkuna bush camping and Palm Beach Road - open (update 11 Jan)Park Alert-Tukkee Wurro (Indian Head) walking track temporary closure (update 10 Jan)Access restricted: Blencoe Falls camping area and Blencoe Falls lookout (update)Temporary walking track closure: Society Flat rainforest walking track, Kirrama National ParkBeach driving - low tide onlyKinkuna bush camping southern access road closed - water damage (update 9 Jan)Temporary closure: Royal Arch Cave and Donna Cave, within Chillagoe-Mungana Caves National ParkFeral animal control program: Endeavour River National ParkTemporary camping area and toilet block closure: Speewah Conservation ParkTaylor Cay seasonal closureDrive safely to road conditions (update 5 Jan)Porcupine Gorge NP wet weather seasonal creek risesWet season closure: Noah Beach camping area, Cape Tribulation, Daintree National Park (CYPAL) (update)Construction of new ranger accommodation (update)Partial Closures - Araucaria Track (update 28 Dec)Temporary track closure: Stingers (the Nationals) track, Smithfield Conservation ParkBridge speed and load limit: Princess Hills Road, Girringun National ParkFlood damage to Booloumba Creek 3 camping areaSafety advice: Scrubby Creek crossing into Eliot Falls camping and day-use area, Apudthama National Park (CYPAL) (update 21 Dec)Temporary closure: camp site 4 Ussher Point camping area, Apudthama National Park (CYPAL) (update 21 Dec)Severe Erosion - Inskip Peninsula camping areas (update 20 Dec)Long term closure of walking tracks in Upper Stony Creek area (update 20 Dec)Seasonal closure of Mount Lewis Road, Mount Lewis National ParkTemporary closure for protection zone burning: Eliot Falls camping and day-use area, Apudthama National Park (CYPAL)Bunyaville toilet facilities and car park  number 1 closed (update 19 Dec)Mt Mee - Mill Rainforest walking track closed due to storm damage (update 19 Dec)Very rough track conditions currently on the Razorback TrackDiana's Bath Road - partial closureCornwells Road, No Heavy Traffic (update 9 Dec)Partial closure of the Kingfisher walk, Conway National Park (update 8 Dec)Planned upgrade to Booloumba Creek 1 camping areaWet season closure: Lama Lama National Park (CYPAL) (update)Temporary closure: Twin Kauris walking track, Lake Barrine, Crater Lakes National Park (update 2 Dec)Munga-Thirri National Park seasonal closureTemporary closure: walking track from Balancing Rock car park to Royal Arch car park, Chillagoe-Mungana Caves National ParkWet season closure: Halifax Bay Wetlands National Park (update 1 Dec)Wet season closure: Rinyirru (Lakefield) National Park (CYPAL) (update)Wet season closure: Princess Hills section, Girringun National Park (update)Wet season closure: Wairuna section, Girringun National Park (update)Wet season closure: Wet Tropics Great Walk, Girringun National Park (update)Wet season closure: Oyala Thumotang National Park (CYPAL) (update)Wet season closure: Cape Melville National Park (CYPAL) (update)Orchid Beach Wongari (dingo) fence construction (update)Dingo (Wongari) Seasonal Information - Summer Season (update 30 Nov)Annual closure period for Rum Jungle and Old Hut camping areasMt Allan fire tower closed to climbing (update 29 Nov)Temporary closure of Bora Ground Road and Maalan Road, Palmerston (Doongan) section, Wooroonooran National ParkRoad closed due to severe weather damage (update 29 Nov)Walking tracks closed (update 29 Nov)Camping area water supply update: Goldsborough Valley section, Wooroonooran National Park (update)Temporary closure: Twin Bridges track (East Black Mountain Road) (update 18 Nov)Burtons Well camping area closure (update)Permanent fire prohibition on Teewah Beach (update 17 Nov)Marine StingersMarine turtles breeding seasonTemporary walking track closure: Saddle track, Kulki day-use area, Cape Tribulation Daintree National Park (CYPAL) (update 7 Nov)Apudthama National Park (CYPAL) (update 4 Nov)Annual closure period for all Lamington bush camping areasWet season closure: Errk Oykangand National Park (CYPAL) (update)Wet season closure: Olkola National Park (CYPAL) (update)Wet season safety information: significant stream rises, Murray Falls, Girramay National ParkWet season safety information - significant stream rises: Cardwell Forest Drive and Five Mile day-use areaWet season safety information: significant stream rises at swimming locations within Paluma Range National ParkWet season closure: Palmer Goldfield Resources Reserve (update)Wet season closure: Canyon Resources Reserve (update)Wet season closure: Rungulla National Park (update)Wet season closure: Rosella Plains lookout trail and Atkinsons lookout trail, Undara Volcanic National ParkChallenging summer hiking conditions on Thorsborne TrailFloating bridge at Lawn Hill gorge, Boodjamulla National Park has been removed (update)Main Range National Park - Gap Creek Falls closed due to wet conditions (update 31 Oct)Wet season safety information: significant stream rises Broadwater, Abergowrie State ForestWet season safety information: significant stream rises at Stony Creek swimming hole, Wallaman Falls, Girringun National ParkTraveston Road closed due to severe weather damageRoad closed due to severe weather damageIf it's flooded, forget it - even on our tracks and trails. (update 11 Oct)Facility closure due to flood damage (update 30 Sep)Temporary partial track closure: Koolmoon Creek track, Misty Mountains wilderness tracks (update 29 Sep)Camper Hygiene (update 27 Sep)Limited parking at Cedar Creek.New Blaksley camping area opening September 2022Information Centre opening hoursSeasonal closure - Carnarvon Great Walk - 4 October 2022 to 28 February 2023 (update)Park alerts for Cape York Peninsula parks are published on individual park pages (update 19 Sep)Lady Musgrave Island, Asbestos Containing Material (ACM)  Hazard (update 14 Sep)North West Island declaration of Special Activity Area (Sharks) (update)Mast Head Island and Beach and Erskine Island and Beach - Seasonal ClosureSafety advice: two tonne load limit restriction on vehicles using Cochable Creek camping and day-use area access road: Tully Gorge National Park (update 11 Aug)Northern Forests walking track closed (update 29 Jul)Temporary closure: Wajil walk (Kearneys Falls walking track), Goldsborough Valley section, Wooroonooran National Park (update 29 Jun)Portable toilets mandatory for Teewah Beach camping zones (update)Johannsen’s Cave is seasonally closedCooloola Wilderness Trail - No pedestrian access across Kin Kin CreekConway National Park, Dryander National Park, Dryander State Forest and Dryander Forest Reserve. Feral animal management program (update)The Bunya Bunya walking track is closed (update 1 Feb)","link":"https://parks.des.qld.gov.au/park-alertshttps://parks.des.qld.gov.au/park-alerts/21736https://parks.des.qld.gov.au/park-alerts/21762https://parks.des.qld.gov.au/park-alerts/22450https://parks.des.qld.gov.au/park-alerts/22162https://parks.des.qld.gov.au/park-alerts/22703https://parks.des.qld.gov.au/park-alerts/22705https://parks.des.qld.gov.au/park-alerts/22706https://parks.des.qld.gov.au/park-alerts/22653https://parks.des.qld.gov.au/park-alerts/22704https://parks.des.qld.gov.au/park-alerts/22682https://parks.des.qld.gov.au/park-alerts/22702https://parks.des.qld.gov.au/park-alerts/22677https://parks.des.qld.gov.au/park-alerts/21734https://parks.des.qld.gov.au/park-alerts/22426https://parks.des.qld.gov.au/park-alerts/22670https://parks.des.qld.gov.au/park-alerts/22654https://parks.des.qld.gov.au/park-alerts/22657https://parks.des.qld.gov.au/park-alerts/22671https://parks.des.qld.gov.au/park-alerts/22648https://parks.des.qld.gov.au/park-alerts/22618https://parks.des.qld.gov.au/park-alerts/21735https://parks.des.qld.gov.au/park-alerts/22699https://parks.des.qld.gov.au/park-alerts/22698https://parks.des.qld.gov.au/park-alerts/22416https://parks.des.qld.gov.au/park-alerts/22407https://parks.des.qld.gov.au/park-alerts/22696https://parks.des.qld.gov.au/park-alerts/22692https://parks.des.qld.gov.au/park-alerts/22694https://parks.des.qld.gov.au/park-alerts/22689https://parks.des.qld.gov.au/park-alerts/22688https://parks.des.qld.gov.au/park-alerts/22647https://parks.des.qld.gov.au/park-alerts/22683https://parks.des.qld.gov.au/park-alerts/22678https://parks.des.qld.gov.au/park-alerts/22676https://parks.des.qld.gov.au/park-alerts/22658https://parks.des.qld.gov.au/park-alerts/22673https://parks.des.qld.gov.au/park-alerts/22611https://parks.des.qld.gov.au/park-alerts/20716https://parks.des.qld.gov.au/park-alerts/22656https://parks.des.qld.gov.au/park-alerts/22672https://parks.des.qld.gov.au/park-alerts/22669https://parks.des.qld.gov.au/park-alerts/22070https://parks.des.qld.gov.au/park-alerts/22667https://parks.des.qld.gov.au/park-alerts/22664https://parks.des.qld.gov.au/park-alerts/22660https://parks.des.qld.gov.au/park-alerts/22662https://parks.des.qld.gov.au/park-alerts/22331https://parks.des.qld.gov.au/park-alerts/22655https://parks.des.qld.gov.au/park-alerts/22636https://parks.des.qld.gov.au/park-alerts/22513https://parks.des.qld.gov.au/park-alerts/22425https://parks.des.qld.gov.au/park-alerts/22645https://parks.des.qld.gov.au/park-alerts/22644https://parks.des.qld.gov.au/park-alerts/22643https://parks.des.qld.gov.au/park-alerts/20019https://parks.des.qld.gov.au/park-alerts/20353https://parks.des.qld.gov.au/park-alerts/22028https://parks.des.qld.gov.au/park-alerts/21451https://parks.des.qld.gov.au/park-alerts/22640https://parks.des.qld.gov.au/park-alerts/22637https://parks.des.qld.gov.au/park-alerts/21289https://parks.des.qld.gov.au/park-alerts/20555https://parks.des.qld.gov.au/park-alerts/22633https://parks.des.qld.gov.au/park-alerts/22630https://parks.des.qld.gov.au/park-alerts/22236https://parks.des.qld.gov.au/park-alerts/21552https://parks.des.qld.gov.au/park-alerts/22614https://parks.des.qld.gov.au/park-alerts/22543https://parks.des.qld.gov.au/park-alerts/21662https://parks.des.qld.gov.au/park-alerts/22606https://parks.des.qld.gov.au/park-alerts/22608https://parks.des.qld.gov.au/park-alerts/22576https://parks.des.qld.gov.au/park-alerts/22540https://parks.des.qld.gov.au/park-alerts/22547https://parks.des.qld.gov.au/park-alerts/22548https://parks.des.qld.gov.au/park-alerts/22575https://parks.des.qld.gov.au/park-alerts/22541https://parks.des.qld.gov.au/park-alerts/22542https://parks.des.qld.gov.au/park-alerts/22244https://parks.des.qld.gov.au/park-alerts/21572https://parks.des.qld.gov.au/park-alerts/22599https://parks.des.qld.gov.au/park-alerts/21110https://parks.des.qld.gov.au/park-alerts/22597https://parks.des.qld.gov.au/park-alerts/22022https://parks.des.qld.gov.au/park-alerts/21792https://parks.des.qld.gov.au/park-alerts/21526https://parks.des.qld.gov.au/park-alerts/17888https://parks.des.qld.gov.au/park-alerts/22574https://parks.des.qld.gov.au/park-alerts/20766https://parks.des.qld.gov.au/park-alerts/22567https://parks.des.qld.gov.au/park-alerts/22559https://parks.des.qld.gov.au/park-alerts/21577https://parks.des.qld.gov.au/park-alerts/22373https://parks.des.qld.gov.au/park-alerts/22531https://parks.des.qld.gov.au/park-alerts/22476https://parks.des.qld.gov.au/park-alerts/22479https://parks.des.qld.gov.au/park-alerts/22524https://parks.des.qld.gov.au/park-alerts/22525https://parks.des.qld.gov.au/park-alerts/22526https://parks.des.qld.gov.au/park-alerts/22473https://parks.des.qld.gov.au/park-alerts/22454https://parks.des.qld.gov.au/park-alerts/22455https://parks.des.qld.gov.au/park-alerts/22523https://parks.des.qld.gov.au/park-alerts/22518https://parks.des.qld.gov.au/park-alerts/22159https://parks.des.qld.gov.au/park-alerts/21980https://parks.des.qld.gov.au/park-alerts/22511https://parks.des.qld.gov.au/park-alerts/22512https://parks.des.qld.gov.au/park-alerts/22471https://parks.des.qld.gov.au/park-alerts/22470https://parks.des.qld.gov.au/park-alerts/22412https://parks.des.qld.gov.au/park-alerts/22168https://parks.des.qld.gov.au/park-alerts/17903https://parks.des.qld.gov.au/park-alerts/21650https://parks.des.qld.gov.au/park-alerts/22421https://parks.des.qld.gov.au/park-alerts/22400https://parks.des.qld.gov.au/park-alerts/22397https://parks.des.qld.gov.au/park-alerts/22364https://parks.des.qld.gov.au/park-alerts/16815https://parks.des.qld.gov.au/park-alerts/20512https://parks.des.qld.gov.au/park-alerts/21395https://parks.des.qld.gov.au/park-alerts/22301https://parks.des.qld.gov.au/park-alerts/17799https://parks.des.qld.gov.au/park-alerts/21389https://parks.des.qld.gov.au/park-alerts/21274https://parks.des.qld.gov.au/park-alerts/21789https://parks.des.qld.gov.au/park-alerts/22141https://parks.des.qld.gov.au/park-alerts/21919https://parks.des.qld.gov.au/park-alerts/21642https://parks.des.qld.gov.au/park-alerts/18598","description":"Changes to conditions in Queensland's national parks, marine parks and forests.The lower two-way section of the Gheerulla Trail Bike area has been extensively damaged by the February and May 2022 rain and flood events. Affected parks: Mapleton National ParkFollowing severe weather events, some roads and facilities within Mapleton National Park remain temporarily  closed. Affected parks: Mapleton National ParkTemporary closure to car park and trail head for a planned upgrade of the Boombana visitor site will commence on 31 January 2023, for completion by May 2023. Affected parks: D'Aguilar National ParkAccess to the Camp Mountain day use area via the sealed access road is closed to vehicles. A large landslip is exposing the road to further subsidence. Affected parks: D'Aguilar National ParkWith high visitation anticipated for Australia Day at Walkabout Creek Discovery Centre, visitors are encouraged to consider parking options. Affected parks: Walkabout Creek Discovery CentreVisitors are advised that the Clarke Range Walking Track, located between Sky Window and Broken River, is closed due to severe land slips along the track caused by recent heavy rainfall. Affected parks: Eungella National Park; Mackay Highlands Great WalkVisitors are advised that Denham Range Campground is temporarily closed due to erosion to access roads caused by recent heavy rainfall. Affected parks: Crediton State ForestKeatings Lagoon walking track and day-use area is currently closed due to flooding. Affected parks: Keatings Lagoon Conservation ParkFirebreak maintenance will be occurring within Nerang National Park during the specified dates (27 Jan - 03 Feb). Heavy machinery will be in use along sections of Firebreaks, MTB riders, Horse riders &amp; walkers/runners and all park visitors are advised to remain well clear of any machinery. Signage will be in place along high use zones. Affected parks: Nerang National ParkVisitors are advised that Cathu State Forest is temporarily closed due to severe erosion to access roads caused by recent heavy rainfall. Affected parks: Cathu State ForestGoldsborough Valley road will be closed for public safety on Tuesday 31 January, Wednesday 1 February and from Monday 6 February through to Thursday 9 February 2023 as Queensland Parks and Wildlife Service (QPWS) conducts road works.  The following facilities will be closed on those dates: Affected parks: Goldfield trail, Wooroonooran National Park; Wooroonooran National Park; Goldsborough Valley, Wooroonooran National ParkDrive with care at Byfield State Forest. Affected parks: Byfield National Park, Conservation Park and State ForestTallebudgera Creek walking track has reopened following repairs to fix damage caused by landslides during recent rain events. Affected parks: Tallebudgera Creek and David Fleay conservation parksAs a result of storm damage, the Joalah Lower Creek circuit within the above mentioned protected area is temporarily closed until declared safe. Heavy rainfall has caused fallen trees, washouts, track scouring and other hazards. Affected parks: Tamborine National ParkIdalia, Welford, Lochern National Parks are temporarily closed due to wet weather until Monday 30 January 2023 when conditions will be reviewed. Affected parks: Welford National Park; Lochern National Park; Idalia National ParkDiamantina National Park is temporarily closed due to flooding until Monday 30 January 2023 when conditions will be reviewed. Affected parks: Diamantina National ParkDue to the ongoing monsoonal conditions across the Gulf of Carpentaria Wiliyan-ngurru National Park and Boodjamulla National Park (including Lawn Hill Gorge and Miyumba camping areas) are temporarily closed until Monday 30 January 2023 when conditions will be reviewed. Affected parks: Lawn Hill Gorge, Boodjamulla (Lawn Hill) National Park; Boodjamulla (Lawn Hill) National ParkDue to wet season conditions sections of the access road leading into the Emu Swamp Camping Area within Blackbraes National Park are boggy, with Werrington Road impassable at a creek crossing. Affected parks: Blackbraes National ParkHoppy Lark's day use area is open to  four-wheel-drive high clearance vehicles only.  Drive to the conditions. Affected parks: Burrum Coast National ParkAs a result of significant rain events between February and May 2022, some walking tracks will remain temporarily closed until declared safe. High amounts of rainfall have caused numerous landslips and large tree falls across the walking tracks. Affected parks: Lamington National ParkAs a result of past wet weather events, the following roads are temporarily closed until declared safe. Affected parks: Bellthorpe National ParkDue to recent heavy rainfall events significant erosion has occurred to all walking tracks and mountain bike trails within the Cape Pallarenda Conservation Park. Please exercise caution whilst using these tracks and trails as some of the sections that have been damaged can be difficult to see due to the undulating nature of the terrain. Affected parks: Cape Pallarenda Conservation ParkQueensland Parks and Wildlife Service, wish to advise that a fox control program is being conducted within the Mouth of the Kolan Conservation Park. The predation of turtle hatchlings by foxes on turtle nests along the Mouth of Kolan Conservation Park Beach coastline has been reduced over the past number of years due to fox control programs and the work of volunteers. However, the loss of nests to foxes is still a very serious threat to turtle conservation. Affected parks: Mouth of Kolan River Conservation ParkAs a result of flood damage due to severe rainfall event on Thursday 22 September, whereby Springbrook received 300mm of rainfall in under 24 hours, some walking tracks are temporarily closed until declared safe. Flood waters have caused fallen trees, landslides, rock falls, washouts, track scouring, and other hazards, including damage to park infrastructure. Affected parks: Springbrook National Park; Gold Coast Hinterland Great WalkAs a result of high fire danger conditions typically experienced on K’gari over the warmer months restrictions on forward bookings for the K’gari (Fraser Island) Great Walk camp areas are implemented yearly from 1 November to 28 February. Great Walk bookings are restricted to minimise disruptions and risk to walkers in times when high fire danger closures are implemented at short notice. Affected parks: K'gari (Fraser Island), Great Sandy National Park; K'gari (Fraser Island) Great WalkQueensland Parks and Wildlife Service wish to advise that access to the Turtle Street Camp site may be restricted from April till June 2023, to facilitate a capital works project. Affected parks: Curtis Island National Park and Conservation ParkHeavy rains are resulting in movement of granite rocks around the creek lines on Magnetic Island. QPWS recommends visitors to the National Park stay on formal walking tracks. Affected parks: Magnetic Island National ParkThe Head Road over Teviot Range, managed by the Scenic Rim Regional Council, is currently closed until further notice, affecting access to sections of Main Range National Park. Affected parks: Main Range National ParkAs a result of heavy rain affecting road conditions, Salvator Rosa section, Carnarvon National Park is closed up to and including Sunday, 29th January. Affected parks: Salvator Rosa, Carnarvon National ParkAs a result of heavy rain affecting road conditions, Ka Ka Mundi section, Carnarvon National Park is closed up to and including Sunday, 29th January. Affected parks: Ka Ka Mundi, Carnarvon National ParkDue to recent wet weather and the high likelihood of tree fall over tracks we would like to caution riders to take extreme care while riding at the Smithfield Mountain Bike Park. Be aware that there is potential for further trees to fall due to heavy rainfall from wet season conditions. Affected parks: Smithfield Conservation ParkWall Creek Road will be temporarily closed to all motorised vehicles from 13 January and is anticipated to reopen 30 April 2023. The closure applies to Wall Creek Road between Tully Falls Road and Red Road. This closure is due to road damage and to allow repairs to be conducted safely. Affected parks: Koombooloomba National Park and Conservation ParkByfield National Park and Byfield Conservation Park will be temporarily closed from 6pm Sunday 19 March 2023 until 9am Saturday 25 March 2023, to allow for pest animal control, including use of firearms by QPWS rangers. For safety reasons, access will not be permitted during this period. Byfield State Forest areas remain open to visitors during this period. Affected parks: Byfield National Park, Conservation Park and State ForestCasuarina, Pandanus and Melaleuca camping areas along Nine Mile Beach will be temporarily closed from 1 to 25 March 2023 and Myrtella camping area on Nine Mile Beach will be closed from 19 March to 31 March 2023. These closures will be in place to allow site rehabilitation and regeneration and pest animal management activities by QPWS Rangers, including use of firearms. The Five Rocks campground will also be closed to allow for pest animal management between 19 and 25 March 2023, as Byfield National Park and Byfield Conservation Park will be closed to all public access over this date range. Affected parks: Byfield National Park, Conservation Park and State ForestThe Northern Access Track sustained major damage due to severe weather and flooding in 2022. The 20km track between Poverty Creek turnoff and Fort Bribie day-use area still has wet and boggy sections that continue to flood with minor rain events. Major roadworks are planned to commence in early 2023, weather permitting, for rebuilding of rock inverts and raise the track level to prevent future closures after rain events. Affected parks: Bribie Island National Park and Recreation AreaThe Queensland Parks and Wildlife Service and Partnerships is upgrading visitor facilities within the Natural Bridge section of Springbrook National Park. Construction has commenced and expected to be completed by the end of March 2023 (weather dependent). Affected parks: Springbrook National ParkKinkuna bush camping area and Palm Beach Road in the Burrum Coast National Park are open.  Affected parks: Burrum Coast National ParkDue to severe erosion, access to Tukkee Wurro (Indian Head) walking track is closed until  further notice. Affected parks: K'gari (Fraser Island), Great Sandy National ParkAccess to Blencoe Falls area and the Kirrama Range from the west is cut at Cashmere Crossing due to recent rain.  Affected parks: Kirrama National Park; Girringun National Park; Blencoe Falls, Girringun National ParkSociety Flat rainforest walking track is temporarily closed until further notice due to safety concerns. There will be no access past the initial boardwalk around the Kauri Pine tree at the start of the walk.  Affected parks: Girringun National Park; Blencoe Falls, Girringun National Park; Kirrama National ParkExposed beaches in the Great Sandy National Park are experiencing very large high tides with some sections of beach impassable. Affected parks: K'gari (Fraser Island), Great Sandy National Park; Inskip Peninsula Recreation Area; Cooloola Recreation Area, Great Sandy National ParkThe southern access road to Kinkuna bush camping is temporarily closed due to damage sustained from heavy rainfall events. Affected parks: Burrum Coast National ParkThe Royal Arch and Donna caves are currently closed for ranger-guided cave tours due to flooding. The caves will be closed until water levels recede and this park alert is amended or removed. Affected parks: Chillagoe-Mungana Caves National ParkA feral animal control program including trapping and shooting will be conducted by Queensland Parks and Wildlife Service in Endeavour River National Park from 5 January 2023 to 30 June 2023 (dates inclusive). The specific sections of the park affected are Stone Wall-Starke Road and Macmillan Streets to suicide bend on Endeavour Valley Road and the northern side of Cooktown airport and Barretts Creek Road. Affected parks: Endeavour River National ParkThe toilet block and camping area will be temporarily closed from 31 January to 2 February 2023 (dates inclusive). The closure is to allow for upgrades to the toilet facilities. Affected parks: Barron Gorge National Park; Speewah Conservation ParkAccess to the beach adjoining Taylor Cay on Taylor Reef (17-064) is prohibited during the seasonal closure period of 10 January to 31 March 2023 to protect roosting and nesting seabirds. Affected parks: Family Islands National Park; Barnard Island Group National ParkThe unsealed section of the Main Tableland Road, from Yaddamen Dhina (Horseshoe lookout) to Gudda Gumoo (Rainbow Falls)  has been impacted by severe weather events. Due to damage caused to crossings, drainage, and the road surface it is now recommended that 4WD vehicles only be used beyond Yaddamen Dhina, where the bitumen road terminates. Affected parks: Blackdown Tableland National ParkDuring the North Queensland wet season local heavy rainfall may cause significant stream rises at Porcupine Gorge National Park  ,During and after heavy rain, creek conditions change and become dangerous. Fast flowing, rapidly rising water with strong currents can occur. At these times, to stay safe, do not enter the water. Affected parks: Porcupine Gorge National ParkNoah Beach camping area is closed for the wet season. It is anticipated to reopen on Friday 7 April 2023, subject to weather and road conditions. Affected parks: Daintree National Park (CYPAL)Construction work is commencing for new ranger accommodation at Ben-Ewa in the Gheebulum Kunungai (Moreton Island) National Park. Affected parks: Gheebulum Kunungai (Moreton Island) National Park and Moreton Island Recreation AreaDue to severe weather events, conditions have changed for the Enoggera Reservoir and surrounding tracks Affected parks: Walkabout Creek Discovery CentreThe Stingers (the Nationals) track will be closed until further notice, due to fallen trees and damaged sustained to the track. All other tracks remain open. Affected parks: Smithfield Conservation ParkThere is a temporary speed and load limit on the first bridge crossing on Princess Hills Road, approximately 7.5km after turning off at the Wairuna Road intersection. The new limits are: Affected parks: Princess Hills, Girringun National Park; Girringun National ParkAs a result of flood damage, camping sites 1, 2, 3, 4, 5 and 8 have been closed. Affected parks: Conondale National ParkThe entry into Eliot Falls camping and day-use area requires crossing Scrubby Creek on the Old Telegraph Track (managed by Cook Shire Council). This crossing is only suitable for high clearance four-wheel-drive vehicles due to severe erosion of the entry and exit points. Affected parks: Jardine River National Park, Heathlands Resources Reserve and Jardine River Resources ReserveCamp site 4 at Ussher Point camping area will be closed for safety reasons until further notice. Affected parks: Jardine River National Park, Heathlands Resources Reserve and Jardine River Resources ReserveBeachfront camping areas at Inskip Peninsula have sustained severe erosion, creating steep drop-offs. Affected parks: Inskip Peninsula Recreation AreaDue to forestry operations, both the Caribbean circuit and Upper Stony circuit walking tracks are closed longer term in the Upper Stony Creek area. The Venusta track remains available for use for visitors and is accessed via the Upper Stony Creek day use area. Affected parks: Byfield National Park, Conservation Park and State ForestThe gate on Mount Lewis Road, at the entrance to Mount Lewis National Park, will be closed due to the onset of the wet season. This annual closure helps to maintain the integrity of the road surface through this period. Note: The closure may affect commercial tour operators. Affected parks: Mount Lewis National ParkEliot Falls camping and day-use areas will be closed on the following dates for protection zone burning, to ensure the safety of visitors and infrastructure: Affected parks: Jardine River National Park, Heathlands Resources Reserve and Jardine River Resources ReserveThe toilet facility on the northern side of the entrance road and car park number 1 is closed for repairs.  Alternative facilities are located nearby on the southern side of the entrance road for both car parking and toilet facilities. Affected parks: Bunyaville Conservation ParkMill rainforest walking track currently closed due to storm damage. Affected parks: D'Aguilar National ParkHigh clearance, low range capable vehicles, along with a reasonable level of four wheel driving experience is required for traversing the Razorback track due to erosion, exposed rock and loose steep surfaces. Affected parks: Kroombit Tops National ParkThe 4WD track Diana's Bath Road in the Mt Mee section of D'Aguilar National Park will be partially closed. Erosion of the track is making driving unsafe. Affected parks: D'Aguilar National ParkCornwells Road, between Wabby Scenic Road and Northern Road/Pile Valley Road will be closed to buses and heavy vehicle traffic from 31 July 2022 until further notice due to maintenance and repairs. Affected parks: K'gari (Fraser Island), Great Sandy National ParkDue to damage sustained during the 2019 Monsoonal event, entry to the Kingfisher walk from the Forestry Road carpark is closed. Affected parks: Conway circuit; Conway National ParkRedevelopment of Booloumba Creek 1 camping area in Conondale National Park will commence from Wednesday 1 February 2023 to Friday 2 June 2023. This area will be closed to the public for the duration and there will be no access to the camping area or creek. Affected parks: Conondale Range Great Walk; Conondale National ParkLama Lama National Park (CYPAL) is closed for the wet season. Affected parks: Lama Lama National Park (CYPAL)Visitors are advised of current works, including temporary closure of the Twin Kauris walking track and partial closure of the lower car park at Lake Barrine, Crater Lakes National Park. Works are expected to be completed mid to late February 2023, subject to conditions. Affected parks: Lake Barrine, Crater Lakes National Park; Crater Lakes National ParkMunga-Thirri National Park (Queensland section of the Simpson Desert) will be closed from 6.00pm Thursday 1 December 2022 until 6.00pm Wednesday 15 March 2023. The purpose of the closure is in the interest of public safety due to anticipated high daytime temperatures during the summer months. Affected parks: Munga-Thirri National ParkThe walking track from the Balancing Rock car park to the Royal Arch car park is temporarily closed due to flooding. The walking track will remain closed during the wet season. Affected parks: Chillagoe-Mungana Caves National ParkHalifax Bay Wetlands National Park is closed for the wet season. The park is anticipated to reopen on 1 April 2023, subject to road and weather conditions. Affected parks: Halifax Bay Wetlands National ParkRinyirru (Lakefield) National Park (CYPAL) is closed for the wet season. The park is anticipated to reopen on the following dates, subject to road and weather conditions. Affected parks: Rinyirru (Lakefield) National Park (CYPAL)Princess Hills section of Girringun National Park is closed for the wet season. It is anticipated to reopen on 1 April 2023, subject to road and weather conditions. Affected parks: Princess Hills, Girringun National Park; Girringun National ParkWairuna section of Girringun National Park will close for the wet season on 1 December 2022. It is anticipated to reopen on 1 April 2023, subject to road and weather conditions. Affected parks: Wairuna, Girringun National Park; Girringun National ParkThe Wet Tropics Great Walk and the associated camp sites listed below are closed for the wet season. They are anticipated to reopen 1 April 2023, subject to track and weather conditions. Affected parks: Girringun National Park; Wallaman Falls Section, Wet Tropics Great Walk; Juwun and Jambal walks, Wet Tropics Great Walk; Wet Tropics Great WalkOyala Thumotang National Park (CYPAL) is closed for the wet season. Affected parks: Oyala Thumotang National Park (CYPAL)Cape Melville National Park (CYPAL) is closed for the wet season. The park is anticipated to reopen 1 August 2023, subject to road and weather conditions. Affected parks: Cape Melville National Park (CYPAL)Fence construction and fire line track clearing around Orchid Beach township will finish by 31 December 2022. Affected parks: K'gari (Fraser Island), Great Sandy National ParkAn increase in dingo-human interactions is expected during the summer holiday season. This is a particularly important time for juvenile wongari (dingoes) to test their strength, learn essential survival skills and to avoid habituation towards people. Juveniles will quickly learn bad habits such as stealing food around camp sites instead of learning natural hunting skills. Affected parks: K'gari (Fraser Island), Great Sandy National Park; K'gari (Fraser Island) Great WalkRum Jungle and Old Hut camping areas will be closed from 1 December 2022 until 31 January 2023 (2 months), to enable natural regeneration of the sites. Affected parks: Mount Barney National ParkMt Allan fire tower in Conondale National Park is temporarily closed to climbing. An engineering report has indicated the tower is not suitable for public access.  The tower will be closed to all access until further notice. Affected parks: Imbil State Forest; Conondale National Park; Conondale Range Great WalkBora Ground Road and Maalan Road  within the Palmerston (Doongan) section of Wooroonooran National Park will be closed for feral animal research and control from Thursday 1 December 2022 to Friday 3 February 2023. Affected parks: Wooroonooran National Park; Palmerston (Doongan), Wooroonooran National ParkAs a result of recent heavy rainfall and flooding, Hill road's section from the Rock Pools day-use area to Tower road is closed until repairs can be carried out.  Affected parks: Woondum National ParkPeach Trees camping area is open, however some surrounding walking tracks and the suspension bridge remain closed due to damage from heavy rainfall and subsequent flooding. Affected parks: Jimna State ForestVisitors are advised there is currently no water available from the taps in the camping and day-use areas within the Goldsborough Valley section of Wooroonooran National Park.  Affected parks: Goldfield trail, Wooroonooran National Park; Goldsborough Valley, Wooroonooran National Park; Wooroonooran National ParkThe Twin Bridges track (East Black Mountain Road) in Kuranda and Mowbray national parks is closed until further notice. The age of the forestry bridges over the creek crossings have caused timber bearers to collapse in sections making the bridges unsafe to traverse. Please adhere to all safety signage and directions from local rangers, and do not enter the closed site. Affected parks: Kuranda National Park and Mowbray National ParkBurtons Well camping area will be closed from 1 February to 30 June 2023, to allow for maintenance and planned upgrades to be carried out. Camping permits are suspended for the duration of this closure. To apply for a refund, contact camping support at qpws@des.qld.gov.au. Affected parks: Bunya Mountains National ParkA QPWS imposed fire prohibition is in place in the Cooloola Recreation Area, except at Poverty Point camping area. Campfires must not be lit anywhere else in the recreation area including in the Teewah Beach camping zones 1-7. Affected parks: Cooloola Recreation Area, Great Sandy National ParkMarine stingers and other dangerous marine life are present, especially during the summer months, in the waters off K’gari (Fraser Island), Hervey Bay and the Great Sandy Strait. Affected parks: K'gari (Fraser Island), Great Sandy National Park; K'gari (Fraser Island) Great WalkFrom November to April, you may see turtles crossing the beach to lay their eggs or hatchlings making their way to the water for the first time.  Affected parks: K'gari (Fraser Island), Great Sandy National Park; Inskip Peninsula Recreation Area; Cooloola Recreation Area, Great Sandy National ParkFollowing a safety audit of infrastructure, Queensland Parks and Wildlife Service have determined the need to close the steps leading from the Kulki car park to the Saddle track as a matter of public safety. The steps will remain closed until such time as they are able to be made safe for public use. Affected parks: Cape Tribulation, Daintree National Park (CYPAL); Daintree National Park (CYPAL)Jardine River National Park and areas of Heathlands Resources Reserve and Jardine Resources Reserve are now Apudthama National Park (CYPAL). Queensland Parks and Wildlife Service and Apudthama National Park (CYPAL) Traditional Owners jointly manage this national park (CYPAL). Affected parks: Jardine River National Park, Heathlands Resources Reserve and Jardine River Resources ReserveDue to the annual closure period, all remote bush camping sites are closed from 1 December to 31 January the following year (2 months), to enable natural regeneration of the sites. Affected parks: Gold Coast Hinterland Great Walk; Lamington National ParkErrk Oykangand National Park (CYPAL) is closed for the wet season. The park is anticipated to reopen 1 May 2023, subject to road and weather conditions. Affected parks: Errk Oykangand National Park (CYPAL)Olkola National Park (CYPAL) is closed for the wet season. The park is anticipated to reopen on 1 July 2023, subject to road and weather conditions. Affected parks: Olkola National Park (CYPAL)During the North Queensland wet season local heavy rainfall may cause significant stream rises at Murray Falls, Girramay National Park. During and after heavy rain, creek conditions change and become dangerous. Fast flowing, rapidly rising water, with strong currents, occurs. At these times, to stay safe, do not enter the water. Affected parks: Girramay National ParkDuring the North Queensland wet season local heavy rainfall may cause significant stream rises at Attie Creek, Dead Horse Creek, the Spa Pool and Five Mile Creek in Cardwell State Forest. During and after heavy rain, creek conditions change and become dangerous. Fast flowing, rapidly rising water, with strong currents, occurs. At these times, to stay safe, do not enter the water. Affected parks: Cardwell State ForestDuring the North Queensland wet season, local heavy rainfall may cause significant stream rises at Jourama Falls, Little Crystal Creek, Rockslides waterhole and Paradise waterhole in Paluma Range National Park. During and after heavy rain, creek conditions change and become dangerous. Fast flowing, rapidly rising water, with strong currents, occurs. At these times, to stay safe, do not enter the water. Affected parks: Mount Spec, Paluma Range National Park; Paluma Range National Park; Jourama Falls, Paluma Range National ParkPalmer Goldfield Resources Reserve is closed for the wet season. It is anticipated to reopen 1 April 2023, subject to road and weather conditions. Affected parks: Palmer Goldfield Resources ReserveCanyon Resources Reserve is closed for the wet season. It is anticipated to reopen on 1 April 2023, subject to weather and road conditions. Affected parks: Canyon Resources ReserveRungulla National Park is closed for the wet season. The park is anticipated to reopen on 1 April 2023, subject to road and weather conditions. Affected parks: Rungulla National ParkDue to wet season conditions and associated safety considerations. Rosella Plains lookout trail and Atkinsons lookout trail are closed to public access. Affected parks: Undara Volcanic National ParkHiking the Thorsborne Trial is considerably challenging during the summer months between October to March. QPWS strongly recommends careful consideration of choosing to undertake the Thorsborne Trail hike during this time. Affected parks: Thorsborne Trail, Hinchinbrook Island National Park; Hinchinbrook Island National ParkThe floating bridge that provides access to the Cascades, Wild Dog and Island Stack walking tracks at Lawn Hill Gorge, Boodjamulla National Park is currently unavailable for use due to flood damage until Saturday 1 April 2023.  These walking tracks are currently only accessible by canoe.  All other walking tracks and campgrounds remain open as normal. Affected parks: Boodjamulla (Lawn Hill) National Park; Lawn Hill Gorge, Boodjamulla (Lawn Hill) National ParkAs a result of  wet conditions, some facilities of Main Range National Park remain closed.   Affected parks: Main Range National ParkDuring the North Queensland wet season local heavy rainfall may cause significant stream rises at Broadwater, Abergowrie State Forest. During and after heavy rain, creek conditions change and become dangerous. Fast flowing, rapidly rising water, with strong currents, occurs. At these times, to stay safe, do not enter the water. Affected parks: Broadwater, Abergowrie State ForestDuring the North Queensland wet season local heavy rainfall may cause significant stream rises at Stony Creek and Wallaman Falls, Girringun National Park. During and after heavy rain, creek conditions change and become dangerous. Fast flowing, rapidly rising water, with strong currents, occurs. At these times, to stay safe, do not enter the water. Affected parks: Wallaman Falls, Girringun National Park; Girringun National ParkAs a result of heavy rainfall and flooding, Traveston Road is temporarily closed until repairs can be carried out. Please observe all signage, barriers, and directions from rangers, and not enter closed areas. Affected parks: Woondum National ParkAs a result of heavy rainfall and flooding, Hill road's section from the Rock Pools Day-use area to Tower Road is closed until repairs can be carried out. Please observe all signage, barriers, and directions from rangers, and not enter closed areas. Affected parks: Woondum National ParkWalking tracks, mountain bike tracks and fire breaks can be affected by heavy rainfall, just like roads can. Heavy rainfall can cause hazards such as rising creeks, flash flooding, and the potential for landslides and rock falls. Affected parks: Nerang National Park; Tamborine National Park; Gold Coast Hinterland Great Walk; Springbrook National Park; Lamington National ParkAs a result of  flood damage, some areas in Conondale National Park remain temporarily closed until declared safe. Affected parks: Imbil State Forest; Conondale Range Great Walk; Conondale National ParkThe section of Koolmoon Creek  walking track between Walters Waterhole camping area and Elizabeth Grant Falls is closed until further notice. Affected parks: Tully Gorge National Park; Tully Falls National Park; Misty Mountains wilderness tracksQueensland Parks and Wildlife Service (QPWS) reminds campers of the need to maintain high personal hygiene standards whilst camping in the Inskip Peninsula Recreation Area. Affected parks: Inskip Peninsula Recreation AreaThere is limited parking at Cedar Creek. The car park fills quickly particularly at weekends and on public holidays. Affected parks: Tamborine National ParkQueensland Parks and Wildlife Service (QPWS) and Quandamooka Yoolooburrabee Aboriginal Corporation (QYAC) wish to advise of the opening of a new camping area in Naree Budjong Djara National Park, called Blaksley camping area. Affected parks: Minjerribah Recreation Area; Naree Budjong Djara National ParkVisitors should be aware, the advertised opening hours of the QPWS Rainbow Beach and Great Sandy Information Centres' are subject to change, at short notice. Affected parks: Inskip Peninsula Recreation Area; K'gari (Fraser Island), Great Sandy National Park; K'gari (Fraser Island) Great Walk; Cooloola Great Walk; Cooloola Recreation Area, Great Sandy National ParkFor safety reasons, the Carnarvon Great Walk will be closed during the bushfire season - 4 October 2022 to 28 February 2023. Affected parks: Carnarvon Great WalkAs there are numerous parks in the Cape York Peninsula area, park alerts are published on individual park pages. Affected parks: Cape York Peninsula parksSmall pieces of Asbestos Containing Material (ACM) have been found and removed from within the camping area. Affected parks: Capricornia Cays National ParkA new Special Activity Area has been declared at North West Island, Capricornia Cays National Park in accordance with Section 128 of the Marine Parks Regulation 2017. Affected parks: Capricornia Cays National ParkThe annual summer closure of Mast Head Island and Beach and Erskine Island and Beach begins from 15 October 2022 to 31 March 2023, inclusive. Affected parks: Capricornia Cays National ParkThe Cochable Creek camping and day-use area access road (H road) is currently restricted to two tonne GVM vehicles. The restriction is due to a council imposed load limit on the timber road bridge, located approximately 3.5km from the Tully River bridge entrance point. Please adhere to load limit signage and check the Gross Vehicle Mass (GVM) of your vehicle before crossing this bridge. Affected parks: Tully section, Tully Gorge National Park; Misty Mountains wilderness tracks; Tully Gorge National ParkPlease be advised that due to fire and weather events the Northern Forests walking track will be closed for maintenance from the 28th July 2022 until 30 January 2023. Affected parks: K'gari (Fraser Island), Great Sandy National ParkThe Wajil walk (Kearneys Falls walking track) is currently closed. This track which starts adjacent to the Bora Ground camping area is barricaded off and remains closed until further notice. Affected parks: Wooroonooran National Park; Goldsborough Valley, Wooroonooran National Park; Goldfield trail, Wooroonooran National ParkQueensland Parks and Wildlife Service (QPWS) has installed a new portable toilet waste facility and introduced mandatory portable toilet requirements at Teewah Beach to address human waste being inappropriately disposed in the area’s natural environment. Affected parks: Cooloola Recreation Area, Great Sandy National ParkJohannsen’s Cave is seasonally closed between 1 June and 1 February, for the protection of threatened ghost bats which use this cave as a maternity site. Access to Johannsen’s Cave is not permitted during this period, unless under permit or authority. Entering Johannsen’s Cave during this period without a valid permit or authority is a breach of the Nature Conservation Act 1992 and penalties may apply. Affected parks: Mount Etna Caves National ParkAs a result of flood damage Figtree Point can only be accessed from Harry’s Hut or the Boronia Walk. The Kin Kin Creek pedestrian bridge linking Elanda Point to Figtree Point on the Cooloola Wilderness Trail has been washed away. Affected parks: Cooloola Recreation Area, Great Sandy National ParkQueensland Parks and Wildlife Service and Partnerships (QPWS&amp;P) is undertaking an extended ground baiting program for feral animals from 1 February 2022 until 1 February 2023 within Conway National Park, Dryander National Park, Dryander State Forest and Dryander Forest Reserve. Affected parks: Dryander National Park; Conway National ParkThe Bunya Bunya walking track is closed until further notice. Affected parks: Bunya Mountains National Park","pubDate":"Fri, 27 Jan 2023 21:23:00 +1000Fri, 27 Jan 2023 14:00:31 +1000Fri, 27 Jan 2023 10:44:02 +1000Fri, 27 Jan 2023 09:46:28 +1000Fri, 27 Jan 2023 09:43:37 +1000Wed, 25 Jan 2023 20:35:33 +1000Wed, 25 Jan 2023 18:01:24 +1000Wed, 25 Jan 2023 17:59:34 +1000Wed, 25 Jan 2023 15:44:43 +1000Wed, 25 Jan 2023 15:26:23 +1000Wed, 25 Jan 2023 15:24:06 +1000Wed, 25 Jan 2023 09:59:12 +1000Tue, 24 Jan 2023 18:05:31 +1000Tue, 24 Jan 2023 10:32:12 +1000Tue, 24 Jan 2023 10:24:04 +1000Mon, 23 Jan 2023 18:53:54 +1000Mon, 23 Jan 2023 18:53:12 +1000Mon, 23 Jan 2023 18:44:17 +1000Mon, 23 Jan 2023 18:39:18 +1000Mon, 23 Jan 2023 17:49:52 +1000Mon, 23 Jan 2023 15:38:25 +1000Fri, 20 Jan 2023 14:37:36 +1000Fri, 20 Jan 2023 12:06:57 +1000Thu, 19 Jan 2023 15:37:45 +1000Thu, 19 Jan 2023 09:27:13 +1000Wed, 18 Jan 2023 16:11:28 +1000Wed, 18 Jan 2023 10:36:59 +1000Mon, 16 Jan 2023 16:44:44 +1000Mon, 16 Jan 2023 14:18:01 +1000Mon, 16 Jan 2023 10:35:04 +1000Mon, 16 Jan 2023 10:33:09 +1000Fri, 13 Jan 2023 12:25:42 +1000Fri, 13 Jan 2023 10:12:58 +1000Fri, 13 Jan 2023 09:29:40 +1000Fri, 13 Jan 2023 09:21:25 +1000Thu, 12 Jan 2023 15:01:54 +1000Wed, 11 Jan 2023 14:34:16 +1000Wed, 11 Jan 2023 12:24:09 +1000Tue, 10 Jan 2023 15:07:59 +1000Tue, 10 Jan 2023 14:10:25 +1000Tue, 10 Jan 2023 12:55:19 +1000Mon, 09 Jan 2023 16:27:46 +1000Mon, 09 Jan 2023 13:47:55 +1000Mon, 09 Jan 2023 09:42:53 +1000Fri, 06 Jan 2023 13:44:34 +1000Fri, 06 Jan 2023 09:19:10 +1000Thu, 05 Jan 2023 16:46:30 +1000Thu, 05 Jan 2023 09:16:21 +1000Tue, 03 Jan 2023 14:58:20 +1000Tue, 03 Jan 2023 10:57:22 +1000Thu, 29 Dec 2022 14:01:00 +1000Wed, 28 Dec 2022 11:57:46 +1000Thu, 22 Dec 2022 14:14:25 +1000Thu, 22 Dec 2022 08:25:04 +1000Wed, 21 Dec 2022 15:57:33 +1000Wed, 21 Dec 2022 08:23:51 +1000Wed, 21 Dec 2022 08:23:22 +1000Tue, 20 Dec 2022 15:51:19 +1000Tue, 20 Dec 2022 09:39:34 +1000Tue, 20 Dec 2022 08:20:41 +1000Mon, 19 Dec 2022 15:30:29 +1000Mon, 19 Dec 2022 10:36:45 +1000Mon, 19 Dec 2022 10:35:40 +1000Tue, 13 Dec 2022 17:38:01 +1000Mon, 12 Dec 2022 12:52:27 +1000Fri, 09 Dec 2022 10:15:22 +1000Thu, 08 Dec 2022 10:02:12 +1000Wed, 07 Dec 2022 09:46:08 +1000Tue, 06 Dec 2022 16:26:18 +1000Fri, 02 Dec 2022 11:01:00 +1000Thu, 01 Dec 2022 17:15:49 +1000Thu, 01 Dec 2022 15:06:31 +1000Thu, 01 Dec 2022 12:37:33 +1000Thu, 01 Dec 2022 11:51:23 +1000Thu, 01 Dec 2022 11:00:02 +1000Thu, 01 Dec 2022 10:58:34 +1000Thu, 01 Dec 2022 10:03:34 +1000Thu, 01 Dec 2022 09:17:25 +1000Thu, 01 Dec 2022 09:16:32 +1000Wed, 30 Nov 2022 16:21:29 +1000Wed, 30 Nov 2022 09:01:36 +1000Tue, 29 Nov 2022 17:12:51 +1000Tue, 29 Nov 2022 14:21:01 +1000Tue, 29 Nov 2022 13:03:38 +1000Tue, 29 Nov 2022 10:07:41 +1000Tue, 29 Nov 2022 10:05:38 +1000Mon, 28 Nov 2022 09:49:52 +1000Fri, 18 Nov 2022 13:52:17 +1000Thu, 17 Nov 2022 12:37:46 +1000Thu, 17 Nov 2022 11:13:29 +1000Tue, 15 Nov 2022 10:13:20 +1000Mon, 14 Nov 2022 11:39:33 +1000Mon, 07 Nov 2022 09:37:03 +1000Fri, 04 Nov 2022 13:59:22 +1000Wed, 02 Nov 2022 11:11:40 +1000Tue, 01 Nov 2022 10:25:49 +1000Tue, 01 Nov 2022 10:25:38 +1000Tue, 01 Nov 2022 09:30:47 +1000Tue, 01 Nov 2022 09:29:49 +1000Tue, 01 Nov 2022 09:29:14 +1000Tue, 01 Nov 2022 08:44:54 +1000Tue, 01 Nov 2022 08:42:12 +1000Tue, 01 Nov 2022 08:41:59 +1000Tue, 01 Nov 2022 08:01:08 +1000Mon, 31 Oct 2022 14:34:28 +1000Mon, 31 Oct 2022 09:40:54 +1000Mon, 31 Oct 2022 07:39:01 +1000Fri, 28 Oct 2022 11:29:15 +1000Fri, 28 Oct 2022 11:28:06 +1000Wed, 19 Oct 2022 15:10:52 +1000Wed, 19 Oct 2022 13:50:40 +1000Tue, 11 Oct 2022 12:23:01 +1000Fri, 30 Sep 2022 12:11:32 +1000Thu, 29 Sep 2022 15:24:46 +1000Tue, 27 Sep 2022 12:58:09 +1000Tue, 27 Sep 2022 10:28:15 +1000Wed, 21 Sep 2022 12:34:00 +1000Tue, 20 Sep 2022 16:40:58 +1000Mon, 19 Sep 2022 13:45:11 +1000Mon, 19 Sep 2022 10:38:20 +1000Wed, 14 Sep 2022 10:28:38 +1000Wed, 14 Sep 2022 10:26:41 +1000Wed, 17 Aug 2022 11:43:09 +1000Thu, 11 Aug 2022 13:17:47 +1000Fri, 29 Jul 2022 15:10:49 +1000Wed, 29 Jun 2022 09:21:07 +1000Tue, 28 Jun 2022 13:14:18 +1000Thu, 23 Jun 2022 17:09:15 +1000Wed, 04 May 2022 10:54:01 +1000Mon, 14 Feb 2022 15:49:26 +1000Tue, 01 Feb 2022 09:51:22 +1000","lastBuildDate":"Fri, 27 Jan 2023 21:23:00 +1000","language":"en-au","ttl":"1440","alerts":[]}